```
SELECT 
  select_list 
FROM 
  table1
INNER JOIN table2 
  ON table1.column_name = table2.column_name;
```

使用别名后
```
SELECT 
  select_list 
FROM 
  table1 t1
INNER JOIN table2 t2 
    ON t1.column_name = t2.column_name;
```

如果要匹配的列的列名相同，可以试用 `USING`
```
SELECT 
  select_list 
FROM 
  table1 t1
INNER JOIN table2 t2 USING(column_name);
```

In [2]:
import common.ipynb_importer
from db.pg.pg_00_common import *

cursor = pg_connect()

In [3]:
sql = """
SELECT 
  customer.customer_id, 
  customer.first_name, 
  customer.last_name, 
  payment.amount, 
  payment.payment_date 
FROM 
  customer 
  INNER JOIN payment ON payment.customer_id = customer.customer_id 
ORDER BY 
  payment.payment_date;
"""
run_sql(cursor, sql)

       customer_id first_name last_name amount               payment_date
0              416    Jeffery    Pinson   2.99 2007-02-14 21:21:59.996577
1              516      Elmer       Noe   4.99 2007-02-14 21:23:39.996577
2              239     Minnie    Romero   4.99 2007-02-14 21:29:00.996577
3              592   Terrance     Roush   6.99 2007-02-14 21:41:12.996577
4               49      Joyce   Edwards   0.99 2007-02-14 21:44:52.996577
...            ...        ...       ...    ...                        ...
14591          163      Cathy   Spencer   0.00 2007-05-14 13:44:29.996577
14592          168     Regina     Berry   0.99 2007-05-14 13:44:29.996577
14593          175    Annette     Olson   3.98 2007-05-14 13:44:29.996577
14594          175    Annette     Olson   0.00 2007-05-14 13:44:29.996577
14595          178     Marion    Snyder   4.99 2007-05-14 13:44:29.996577

[14596 rows x 5 columns]

In [4]:
# 更短一点的写法
sql = """
SELECT 
  c.customer_id, 
  c.first_name, 
  c.last_name, 
  p.amount, 
  p.payment_date 
FROM 
  customer c 
  INNER JOIN payment p ON p.customer_id = c.customer_id 
ORDER BY 
  p.payment_date;
"""
run_sql(cursor, sql)

       customer_id first_name last_name amount               payment_date
0              416    Jeffery    Pinson   2.99 2007-02-14 21:21:59.996577
1              516      Elmer       Noe   4.99 2007-02-14 21:23:39.996577
2              239     Minnie    Romero   4.99 2007-02-14 21:29:00.996577
3              592   Terrance     Roush   6.99 2007-02-14 21:41:12.996577
4               49      Joyce   Edwards   0.99 2007-02-14 21:44:52.996577
...            ...        ...       ...    ...                        ...
14591          163      Cathy   Spencer   0.00 2007-05-14 13:44:29.996577
14592          168     Regina     Berry   0.99 2007-05-14 13:44:29.996577
14593          175    Annette     Olson   3.98 2007-05-14 13:44:29.996577
14594          175    Annette     Olson   0.00 2007-05-14 13:44:29.996577
14595          178     Marion    Snyder   4.99 2007-05-14 13:44:29.996577

[14596 rows x 5 columns]

In [5]:
# USING
sql = """
SELECT 
  customer_id, 
  first_name, 
  last_name, 
  amount, 
  payment_date 
FROM 
  customer 
  INNER JOIN payment USING(customer_id) 
ORDER BY 
  payment_date;
"""
run_sql(cursor, sql)

       customer_id first_name last_name amount               payment_date
0              416    Jeffery    Pinson   2.99 2007-02-14 21:21:59.996577
1              516      Elmer       Noe   4.99 2007-02-14 21:23:39.996577
2              239     Minnie    Romero   4.99 2007-02-14 21:29:00.996577
3              592   Terrance     Roush   6.99 2007-02-14 21:41:12.996577
4               49      Joyce   Edwards   0.99 2007-02-14 21:44:52.996577
...            ...        ...       ...    ...                        ...
14591          163      Cathy   Spencer   0.00 2007-05-14 13:44:29.996577
14592          168     Regina     Berry   0.99 2007-05-14 13:44:29.996577
14593          175    Annette     Olson   3.98 2007-05-14 13:44:29.996577
14594          175    Annette     Olson   0.00 2007-05-14 13:44:29.996577
14595          178     Marion    Snyder   4.99 2007-05-14 13:44:29.996577

[14596 rows x 5 columns]

In [8]:
sql = """
SELECT 
  c.customer_id, 
  c.first_name || ' ' || c.last_name customer_name, 
  s.first_name || ' ' || s.last_name staff_name, 
  p.amount, 
  p.payment_date 
FROM 
  customer c 
  INNER JOIN payment p USING (customer_id) 
  INNER JOIN staff s using(staff_id) 
ORDER BY 
  payment_date;
"""
run_sql(cursor, sql)

       customer_id   customer_name    staff_name amount  \
0              416  Jeffery Pinson  Jon Stephens   2.99
1              516       Elmer Noe  Jon Stephens   4.99
2              239   Minnie Romero  Mike Hillyer   4.99
3              592  Terrance Roush  Jon Stephens   6.99
4               49   Joyce Edwards  Mike Hillyer   0.99
...            ...             ...           ...    ...
14591          163   Cathy Spencer  Mike Hillyer   0.00
14592          168    Regina Berry  Mike Hillyer   0.99
14593          175   Annette Olson  Jon Stephens   3.98
14594          175   Annette Olson  Jon Stephens   0.00
14595          178   Marion Snyder  Mike Hillyer   4.99

                    payment_date
0     2007-02-14 21:21:59.996577
1     2007-02-14 21:23:39.996577
2     2007-02-14 21:29:00.996577
3     2007-02-14 21:41:12.996577
4     2007-02-14 21:44:52.996577
...                          ...
14591 2007-05-14 13:44:29.996577
14592 2007-05-14 13:44:29.996577
14593 2007-05-14 13:44:29.996577
14594 2007-05-14 13:44:29.996577
14595 2007-05-14 13:44:29.996577

[14596 rows x 5 columns]